<!DOCTYPE>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	<title>Européennes : tous les partis pensent-ils pareil ?</title>
	<link href="css/lemonde.css" rel="stylesheet" type="text/css">
	<link href="css/mycss.css" rel="stylesheet" type="text/css">
  <link href="css/decodeurs.css" rel="stylesheet" type="text/css">
	<link rel="stylesheet" href="css/jquery-ui.css" />
	<link rel="stylesheet" type="text/css" href="http://s1.lemde.fr/medias/web/css/fonts.css"/>
	<script src="http://code.jquery.com/jquery-1.9.1.js"></script>
	<script src="http://code.jquery.com/ui/1.10.1/jquery-ui.js"></script>
	<script src="http://d3js.org/d3.v3.min.js"></script>
  <script src="js/data.js"></script>
  
</head>
<body>	
	<script src="js/d3tip.js"></script>

<div id="articleBody" class="alpha omega">
   <div class="container_18 clearfix">
              <div class="grid_12 txt15_140 pad16 alpha rappel">
                <p>Au Parlement europ&eacute;en, la formation d&rsquo;une coalition est un sport obligatoire. La majorit&eacute; n&rsquo;est pas garantie pour un groupe parlementaire, et s&rsquo;assurer du vote d&rsquo;un texte n&eacute;cessite de travailler sa coalition. On voit ainsi des coalitions allant de la gauche radicale au centre, ou d&rsquo;autres des sociaux-d&eacute;mocrates au Parti populaire.</p>
                <p>Nous avons choisi cinq votes de ces derniers mois, repr&eacute;sentatifs des secteurs sur lesquels le Parlement d&eacute;cide ou peut s&rsquo;exprimer, pour montrer la vari&eacute;t&eacute; des coalitions : &eacute;conomie, social, environnement, num&eacute;rique et international. Certains ont d&eacute;bouch&eacute; sur des d&eacute;cisions, d&rsquo;autres n&rsquo;ont &eacute;t&eacute; que purement consultatifs, comme celui sur le paquet climat.</p>
                <p>Ces votes sont &eacute;galement int&eacute;ressants puisque pour certains d&rsquo;entre eux, des parlementaires fran&ccedil;ais ont choisi de se distinguer de leurs groupes : des repr&eacute;sentants hexagonaux du PPE ont ainsi vot&eacute; pour le paquet climat. M&ecirc;me sch&eacute;ma pour des socialistes fran&ccedil;ais s&rsquo;abstenant sur le mandat confi&eacute; &agrave; la Commission europ&eacute;enne pour n&eacute;gocier le trait&eacute; de libre-&eacute;change avec les Etats-Unis (Tafta), alors que le PSE l&rsquo;approuvait &agrave; pr&egrave;s de 90 %.</p>
              </div>
              <div class="article txt4 grid_6 omega col_droite mgt32">
                        <div class="bloc_base menu_ancre">
                            <ol> 
                                <li><a href="#partie1">Le paquet climat-énergie</a></li> 
                                <li><a href="#partie2">L'union bancaire</a></li>
                                <li><a href="#partie3">La protection des données personnelles</a></li>
                                <li><a href="#partie4">Les travailleurs détachés</a></li>
                                <li><a href="#partie5">Le traité transatlantique (Tafta)</a></li>
                            </ol> 
                        </div>
              </div>
    </div>  
    <div class="container_18 clearfix prefix_1 suffix_1">
        <div class="bloc_gris_neutre bordt1 pad16 mgb32 mgt32 rappel grid_5 alpha"> 
          <p class="tt5">Comment lire les infographies</p> 
         <p>Pour chacun des cinq grands votes s&eacute;lectionn&eacute;s, nous avons positionn&eacute; sur la premi&egrave;re ligne l&rsquo;ensemble des 75 d&eacute;put&eacute;s en fonction de leur vote&nbsp;: pour, abstention ou contre.</p>
          <p>Sur la deuxi&egrave;me ligne, nous avons indiqu&eacute; la position majoritaire des sept groupes du Parlement europ&eacute;en. Le pourcentage indique la proportion d&rsquo;eurod&eacute;put&eacute;s de chaque groupe &agrave; avoir adopt&eacute; cette position.</p>
          <p>En comparant les deux lignes, on peut donc se demander si les d&eacute;put&eacute;s fran&ccedil;ais ont vot&eacute; conform&eacute;ment &agrave; la ligne directrice de leur groupe politique europ&eacute;en.</p>
      </div>


        <div class="bloc_gris_neutre bordt1 pad16 mgb32 mgt32 rappel grid_11 omega rappel"> 
          <p class="tt5">Rappel : comment fonctionne le Parlement européen</p> 
            <p>La France a 74 d&eacute;put&eacute;s au Parlement de Strasbourg, issus de 11 partis diff&eacute;rents. Chaque mouvement fran&ccedil;ais est rattach&eacute; &agrave; un groupe parlementaire europ&eacute;en correspondant &agrave; sa famille politique :</p>
            <ul class="lien_ancres">
                <li>
                <p><strong>L&rsquo;UMP, l&rsquo;UDI, le Nouveau Centre et le Parti radical</strong> si&egrave;gent avec les conservateurs du PPE (Parti populaire europ&eacute;en).</p>
                </li>
                <li>
                <p><strong>Le PS</strong> est dans le groupe de l'Alliance progressiste des socialistes et d&eacute;mocrates (S&amp;D).</p>
                </li>
                <li>
                <p><strong>Le MoDem et Corinne Lepage (Cap21)</strong> &eacute;margent chez les lib&eacute;raux et centristes de l&rsquo;ADLE (Alliance des d&eacute;mocrates et des lib&eacute;raux pour l&rsquo;Europe).</p>
                </li>
                <li>
                <p><strong>Europe Ecologie-Les Verts</strong> appartient au groupe des Verts europ&eacute;ens/Alliance libre europ&eacute;enne.</p>
                </li>
                <li>
                <p>Philippe de Villiers, membre du <strong>Mouvement pour la France</strong> (MPF), est int&eacute;gr&eacute; au groupe ELD (Europe libert&eacute;s d&eacute;mocratie).</p>
                </li>
                <li>
                <p><strong>Le Front national</strong> si&egrave;ge chez les non-inscrits.</p>
                </li>
            </ul>
            <p>Il existe un septi&egrave;me groupe au Parlement europ&eacute;en, dans lequel ne si&egrave;ge aucun Fran&ccedil;ais : celui des <strong>conservateurs et r&eacute;formistes europ&eacute;ens</strong> (CRE).</p>
            <p><em>Nota :</em> Christine Revault d'Allonnes-Bonnefoy ayant remplac&eacute; Harlem D&eacute;si le 9 avril, nous l&rsquo;avons int&eacute;gr&eacute;e comme 75e d&eacute;put&eacute;e.</span></p>
         </div>

      </div>
  </div>



<div class="article alpha container_18 clearfix">	
  <div id="partie1" class="num_partie"> 
   <h2 class="tt3">1. Le paquet climat-énergie</h2> 
  </div> 
  <div class="grid_16 txt15_140 prefix_1 suffix_1">
      <p>Cette r&eacute;solution a &eacute;t&eacute; adopt&eacute;e le 5 f&eacute;vrier par le Parlement, en pleine discussion sur le contenu du futur &laquo;&nbsp;paquet &eacute;nergie-climat&nbsp;&raquo; qui doit remplacer celui conclu en 2009. Les d&eacute;put&eacute;s europ&eacute;ens ont appel&eacute; la Commission et les Etats membres &agrave; adopter de nouveaux objectifs contraignants sur la r&eacute;duction des &eacute;missions de gaz &agrave; effet de serre, de consommation d&rsquo;&eacute;nergie renouvelables et de r&eacute;duction de la consommation &eacute;nerg&eacute;tique d&rsquo;ici &agrave; 2030.</p>
      <p>Sur ce vote purement consultatif, deux blocs clairs se sont d&eacute;tach&eacute;s : d&rsquo;un c&ocirc;t&eacute; la gauche, les &eacute;cologistes et les centristes lib&eacute;raux, favorables au texte&nbsp;; de l'autre, la droite et les eurosceptiques (groupes ELD et ECR).</p>
      <p>On constate que les centristes fran&ccedil;ais (UDI, Parti radical et Nouveau Centre), membres du groupe de droite PPE, se sont distingu&eacute;s de leurs coll&egrave;gues UMP en votant pour le texte. Une position qui semblait anticiper leur future int&eacute;gration au groupe lib&eacute;ral ADLE (apr&egrave;s les &eacute;lections europ&eacute;ennes du 25 mai), qui avait vot&eacute; pour.</p>
      <p>Autre vote &eacute;tonnant : l&rsquo;abstention de l&rsquo;eurod&eacute;put&eacute;e Front de gauche Marie-Christine Vergiat, qu&rsquo;elle n&rsquo;a pas justifi&eacute;e publiquement, malgr&eacute; la position majoritairement favorable de son groupe, la GUE/NGL.</p>
      <p>Marine Le Pen, seule d&eacute;put&eacute;e Front national &agrave; se prononcer, s&rsquo;est rang&eacute;e dans le camp des anti.</p>
      <p class="lire">Lire (&eacute;dition abonn&eacute;s) : <a href="http://www.lemonde.fr/economie/article/2014/01/11/climat-l-europe-peine-a-se-fixer-un-cap-pour-2030_4346443_3234.html" target="_blank">Climat : l&rsquo;Europe peine &agrave; se fixer un cap pour 2030</a></p>
  </div>

	<div id="climat" class="bubbles">
          <div class="legende">
                <ul>
                      <li class="ump"></span>UMP (parti populaire européen)</li>
                      <li class="udi"></span>UDI / Nouveau Centre / PR (PPE)</li>
                      <li class="modem"></span>MoDem / Cap21 (démocrates et des libéraux)</li>
                      <li class="eelv"></span>EELV (verts européens)</li>
                      <li class="ps"></span>PS (socialistes et démocrates)</li>
                      <li class="fg"></span>Front de gauche (gauche unitaire européenne)</li>
                      <li class="mpf"></span>MPF (Europe libertés démocratie)</li>
                      <li class="fn"></span>FN (non-inscrits)</li>
                      <li class="ecr"></span>Conservateurs et réformistes</li>
                </ul>
          </div>
  </div>
  <p class="sourcing"><a href="http://www.votewatch.eu/en/a-2030-framework-for-climate-and-energy-policies-motion-for-resolution-vote-envi-and-iter-committee-.html" target="_blank">Les résultats complets du vote sur VoteWatch.eu</a></p>



  <div id="partie2" class="num_partie"> 
   <h2 class="tt3">2. L'union bancaire</h2> 
  </div> 
  <div class="grid_16 txt15_140 prefix_1 suffix_1">
      <p>Il s&rsquo;agit l&agrave; d&rsquo;un vote de grande port&eacute;e, puisqu&rsquo;il s&rsquo;agissait du dernier feu vert avant la mise en place de l&rsquo;union bancaire. Les trois textes (sur le m&eacute;canisme de r&eacute;solution unique, la r&eacute;solution des crises bancaires et la garantie des d&eacute;p&ocirc;ts bancaires) ont &eacute;t&eacute; adopt&eacute;s le 15 avril 2014 &agrave; une &eacute;crasante majorit&eacute; de 84,9&nbsp;% des eurod&eacute;put&eacute;s. S&rsquo;y sont oppos&eacute;s la gauche radicale et les eurosceptiques de l&rsquo;EFD. Les premiers, consid&eacute;rant qu&rsquo;il s&rsquo;agit d&rsquo;une mauvaise solution au probl&egrave;me des dettes, les seconds, par refus du principe de solidarit&eacute; entre les Etats&nbsp;membres.</p>
<p>Un sch&eacute;ma totalement respect&eacute; par les d&eacute;put&eacute;s fran&ccedil;ais, qui ont tous vot&eacute; selon la ligne majoritaire de leur groupe. Le Front national, qui si&egrave;ge chez les non-inscrits, s&rsquo;est prononc&eacute; contre l&rsquo;union bancaire.</p>
<p class="lire">Lire nos explications : <a href="http://www.lemonde.fr/economie/article/2014/04/15/le-parlement-europeen-adopte-l-union-bancaire_4401847_3234.html" target="_blank">Ce qui va changer avec l'union bancaire en Europe</a></p>
  </div>


  <div id="union_bancaire" class="bubbles">
    <div class="legende">
                <ul>
                      <li class="ump"></span>UMP (parti populaire européen)</li>
                      <li class="udi"></span>UDI / Nouveau Centre / PR (PPE)</li>
                      <li class="modem"></span>MoDem / Cap21 (démocrates et des libéraux)</li>
                      <li class="eelv"></span>EELV (verts européens)</li>
                      <li class="ps"></span>PS (socialistes et démocrates)</li>
                      <li class="fg"></span>Front de gauche (gauche unitaire européenne)</li>
                      <li class="mpf"></span>MPF (Europe libertés démocratie)</li>
                      <li class="fn"></span>FN (non-inscrits)</li>
                      <li class="ecr"></span>Conservateurs et réformistes</li>
                </ul>
          </div>
  </div>
  <p class="sourcing"><a href="http://www.votewatch.eu/en/resolution-of-credit-institutions-and-certain-investment-firms-in-the-framework-of-a-single-resoluti.html" target="_blank">Les résultats complets du vote sur VoteWatch.eu</a></p>
  
  <div id="partie3" class="num_partie"> 
   <h2 class="tt3">3. La protection des données personnelles</h2> 
  </div> 
  <div class="grid_16 txt15_140 prefix_1 suffix_1">
<p>Ce vote, qui s&rsquo;est tenu le 14 mars 2014, visait &agrave; valider le projet de directive de la Commission europ&eacute;enne sur la protection des donn&eacute;es personnelles. Il s&rsquo;est sold&eacute; par une quasi-unanimit&eacute; des votants (95 % des d&eacute;put&eacute;s, tous les groupes) en faveur d&rsquo;<a href="http://www.europarl.europa.eu/news/fr/news-room/content/20140307IPR38204/html/Des-r%C3%A8gles-plus-strictes-pour-prot%C3%A9ger-la-vie-priv%C3%A9e-%C3%A0-l'%C3%A8re-num%C3%A9rique" target="_blank">un contr&ocirc;le accru des citoyens sur leurs donn&eacute;es en ligne</a>. Un vote moins unanime pourra avoir lieu lorsque le texte final reviendra de la Commission.</p>
<p>Le seul d&eacute;put&eacute; fran&ccedil;ais &agrave; s&rsquo;abstenir sur le texte a &eacute;t&eacute; Jean-Marie Le Pen, qui si&egrave;ge chez les non-inscrits.</p>
  </div>

  <div id="protection_donnees" class="bubbles">
        <div class="legende">
                <ul>
                      <li class="ump"></span>UMP (parti populaire européen)</li>
                      <li class="udi"></span>UDI / Nouveau Centre / PR (PPE)</li>
                      <li class="modem"></span>MoDem / Cap21 (démocrates et des libéraux)</li>
                      <li class="eelv"></span>EELV (verts européens)</li>
                      <li class="ps"></span>PS (socialistes et démocrates)</li>
                      <li class="fg"></span>Front de gauche (gauche unitaire européenne)</li>
                      <li class="mpf"></span>MPF (Europe libertés démocratie)</li>
                      <li class="fn"></span>FN (non-inscrits)</li>
                      <li class="ecr"></span>Conservateurs et réformistes</li>
                </ul>
          </div>
  </div>
  <p class="sourcing"><a href="http://www.votewatch.eu/en/protection-of-individuals-with-regard-to-the-processing-of-personal-data-draft-legislative-resolutio.html" target="_blank">Les résultats complets du vote sur VoteWatch.eu</a></p>

  <div id="partie4" class="num_partie"> 
   <h2 class="tt3">4. Les travailleurs détachés</h2> 
  </div> 
  <div class="grid_16 txt15_140 prefix_1 suffix_1">
    <p>La r&eacute;forme de la directive sur les travailleurs d&eacute;tach&eacute;s, fruit d&rsquo;un compromis d&eacute;licat entre sociaux-d&eacute;mocrates, conservateurs et lib&eacute;raux, a &eacute;t&eacute; adopt&eacute;e &agrave; plus de 70 % par le Parlement europ&eacute;en le 16 avril 2014. Elle pr&eacute;voyait notamment de mieux d&eacute;finir ce statut pour &eacute;viter les abus par les entreprises.</p>
    <p class="lire">Lire notre &eacute;clairage : <a href="http://www.lemonde.fr/emploi/article/2013/12/02/cinq-questions-autour-des-travailleurs-detaches_3523921_1698637.html" target="_blank">Six questions autour du statut de &laquo; travailleur d&eacute;tach&eacute; &raquo;</a></p>
    <p>Si elle a re&ccedil;u un soutien des conservateurs, des lib&eacute;raux, des &eacute;cologistes et des eurosceptiques de l&rsquo;ECR, ainsi que l&rsquo;opposition franche de la gauche radicale, cette r&eacute;forme a vivement divis&eacute; le groupe social-d&eacute;mocrate (62 pour, 89 contre). En France, en revanche, les socialistes n&rsquo;ont pas h&eacute;sit&eacute; : tous ont vot&eacute; en faveur du texte, <a href="http://www.deputes-socialistes.eu/?p=10400">se f&eacute;licitant des &laquo;&nbsp;avanc&eacute;es&nbsp;&raquo;</a> introduites par le texte.</p>
    <p>Au meeting de lancement de la campagne europ&eacute;enne du Parti socialiste europ&eacute;en, &agrave; Paris, son champion, Martin Schulz, a salu&eacute; ce &laquo;&nbsp;<a href="http://www.politis.fr/Europeennes-le-mensonge-du-PS-sur,26933.html" target="_blank">signe clair</a>&nbsp;&raquo; adress&eacute; par le Parlement europ&eacute;en, alors que tous ses coll&egrave;gues allemands ont vot&eacute; contre&nbsp;!</p>
    <p>Signe de l&rsquo;ambigu&iuml;t&eacute; de sa position, il a promis dans la foul&eacute;e de faire r&eacute;&eacute;crire la directive en cas de victoire.</p>
    <p>L&rsquo;UMP, le MoDem, Europe Ecologie-Les Verts et l&rsquo;UDI ont tous vot&eacute; comme un seul homme en faveur du texte, &agrave; une exception pr&egrave;s : Jean-Luc Bennahmias, qui a vot&eacute; contre, <a href="http://www.mouvementdemocrate.fr/article/travailleurs-detaches-le-dumping-social-risque-davoir-encore-de-beaux-jours-devant-lui" target="_blank">estimant que le texte</a> &laquo;&nbsp;ne levait pas toutes les incertitudes quant au risque de dumping social&nbsp;&raquo; au sein de l&rsquo;Union.</p>
    <p>Les trois d&eacute;put&eacute;s du Front national, <a href="http://www.lemonde.fr/europeennes-2014/article/2014/04/16/europe-marine-le-pen-et-le-texte-criminel-sur-les-travailleurs-detaches_4402325_4350146.html" target="_blank">qui ont qualifi&eacute; le texte de &laquo;&nbsp;criminel&nbsp;&raquo; et de </a></p>
    <p>&laquo;&nbsp;<a href="http://www.lemonde.fr/europeennes-2014/article/2014/04/16/europe-marine-le-pen-et-le-texte-criminel-sur-les-travailleurs-detaches_4402325_4350146.html" target="_blank">bombe &agrave; fragmentation sociale</a>&nbsp;&raquo;, ont pourtant choisi de s&rsquo;abstenir. Le Front de gauche, &agrave; l&rsquo;inverse, a mis son vote en conformit&eacute; avec ses paroles en votant contre, conform&eacute;ment &agrave; la ligne majoritaire de son groupe europ&eacute;en.</p>
  </div>

  <div id="travailleurs_detaches" class="bubbles">
      <div class="legende">
                <ul>
                      <li class="ump"></span>UMP (parti populaire européen)</li>
                      <li class="udi"></span>UDI / Nouveau Centre / PR (PPE)</li>
                      <li class="modem"></span>MoDem / Cap21 (démocrates et des libéraux)</li>
                      <li class="eelv"></span>EELV (verts européens)</li>
                      <li class="ps"></span>PS (socialistes et démocrates)</li>
                      <li class="fg"></span>Front de gauche (gauche unitaire européenne)</li>
                      <li class="mpf"></span>MPF (Europe libertés démocratie)</li>
                      <li class="fn"></span>FN (non-inscrits)</li>
                      <li class="ecr"></span>Conservateurs et réformistes</li>
                </ul>
          </div>
  </div>
  <p class="sourcing"><a href="http://www.votewatch.eu/en/posting-of-workers-in-the-framework-of-the-provision-of-services-draft-legislative-resolution-vote-l.html" target="_blank">Les résultats complets du vote sur VoteWatch.eu</a></p>

  <div id="partie5" class="num_partie"> 
   <h2 class="tt3">5. Le traité transatlantique (Tafta)</h2> 
  </div> 
  <div class="grid_16 txt15_140 prefix_1 suffix_1">
    <p>Le Parlement europ&eacute;en a valid&eacute; le 23 mai 2013, &agrave; une majorit&eacute; de plus de 77 %, le mandat confi&eacute; &agrave; la Commission europ&eacute;enne pour n&eacute;gocier avec les Etats-Unis le trait&eacute; de libre-&eacute;change Tafta/TTIP. Celui-ci excluait notamment des discussions le secteur de l&rsquo;audiovisuel, <a href="http://www.lemonde.fr/economie/article/2013/05/24/exception-culturelle-les-eurodeputes-appuient-paris-et-desavouent-bruxelles_3416850_3234.html">&agrave; la demande de Paris</a>.</p>
    <p>Un an plus tard, alors que <a href="http://www.lemonde.fr/europeennes-2014/article/2014/05/13/le-traite-transatlantique-s-invite-dans-la-campagne-europeenne_4415834_4350146.html" target="_blank">le sujet est devenu l&rsquo;une des grandes th&eacute;matiques de la campagne des europ&eacute;ennes</a>, on constate que les positions n&rsquo;ont pas boug&eacute; d&rsquo;un pouce : conservateurs avaient vot&eacute; pour, sociaux-d&eacute;mocrates et lib&eacute;raux s&rsquo;&eacute;taient abstenus, tandis que les &eacute;cologistes et la gauche radicale avaient vot&eacute; contre.</p>
    <p>En revanche, il est int&eacute;ressant de constater que les socialistes fran&ccedil;ais, aujourd&rsquo;hui tr&egrave;s embarrass&eacute;s par la question, &eacute;taient d&eacute;j&agrave; dans une posture ambigu&euml; &agrave; l&rsquo;&eacute;poque. Fran&ccedil;oise Castex, qui avait vot&eacute; contre, <a href="http://www.lemonde.fr/europeennes-2014/article/2014/05/09/francoise-castex-eurodeputee-assidue-et-debarquee_4413991_4350146.html" target="_blank">a &eacute;t&eacute; d&eacute;barqu&eacute;e de sa circonscription par le PS avant de rejoindre le parti Nouvelle Donne</a>. La seconde abstentionniste, Isabelle Thomas, n&rsquo;a en revanche pas subi de repr&eacute;sailles de la part de son parti, puisqu&rsquo;elle a pris la t&ecirc;te de la liste socialiste dans l&rsquo;Ouest.</p>
    <p>Le Front national et le Front de gauche, qui ont fait aujourd&rsquo;hui de la lutte contre Tafta l&rsquo;un des axes de leur campagne europ&eacute;enne, portaient d&eacute;j&agrave; la m&ecirc;me position il y a un an : tous leurs d&eacute;put&eacute;s avaient vot&eacute; contre le mandat de n&eacute;gociation.</p>
    <p>Enfin, la d&eacute;put&eacute;e de Cap21 Corinne Lepage, qui si&eacute;geait avec le MoDem chez les lib&eacute;raux, avait d&eacute;j&agrave; d&eacute;cid&eacute; de se d&eacute;solidariser d&rsquo;eux en votant contre. Son mouvement pour les europ&eacute;ennes de&nbsp;2014, &laquo;&nbsp;Europe citoyenne&nbsp;&raquo;, <a href="http://europecitoyenne.net/ttip/" target="_blank">a pris un an plus tard clairement position contre le trait&eacute;</a>.</p>
    <p>Le nouveau parlement issu des urnes aura la responsabilit&eacute; de ratifier le trait&eacute; en fin de n&eacute;gociation : en cas de vote n&eacute;gatif, celui-ci sera enterr&eacute;.</p>
    <p class="lire">Pour en savoir plus, <a href="http://www.lemonde.fr/les-decodeurs/article/2014/04/15/il-pourrait-changer-la-face-de-l-europe-le-traite-transatlantique-decode_4399476_4355770.html" target="_blank">lire notre d&eacute;cryptage sur le trait&eacute; transatlantique</a></p>
  </div>
  <div id="ttip" class="bubbles">
      <div class="legende">
                <ul>
                      <li class="ump"></span>UMP (parti populaire européen)</li>
                      <li class="udi"></span>UDI / Nouveau Centre / PR (PPE)</li>
                      <li class="modem"></span>MoDem / Cap21 (démocrates et des libéraux)</li>
                      <li class="eelv"></span>EELV (verts européens)</li>
                      <li class="ps"></span>PS (socialistes et démocrates)</li>
                      <li class="fg"></span>Front de gauche (gauche unitaire européenne)</li>
                      <li class="mpf"></span>MPF (Europe libertés démocratie)</li>
                      <li class="fn"></span>FN (non-inscrits)</li>
                      <li class="ecr"></span>Conservateurs et réformistes</li>
                </ul>
          </div>
  </div>
</div>
<p class="sourcing"><a href="http://www.votewatch.eu/en/eu-trade-and-investment-agreement-negotiations-with-the-us-motion-for-resolution-vote-resolution-as-.html" target="_blank">Les résultats complets du vote sur VoteWatch.eu</a></p>

  

<div class="container_18">
  <div class="article txt15_140 grid_10 alpha prefix_1 suffix_1">
    
      <div class="bg_gris_moyen signature">
              <ul class="liste_bordure">
              <li class="clearfix" itemprop="author">
              <span class="identite">
              <a href="http://www.lemonde.fr/journaliste/alexandre-lechenet/" target="_blank" class="gras">Alexandre Léchenet</a>
              <br><span class="txt_gris_clair">Journaliste au Monde</span>

              </span>
              <span class="suivre">
              <strong class="txt1 txt_gris_moyen">Suivre</strong>
              <a href="http://www.lemonde.fr/journaliste/alexandre-lechenet/" class="avatar13x13" target="_blank">Aller sur la page de ce journaliste</a>
              <a href="https://twitter.com/alphoenix" class="tw13x13" target="_blank">Suivre ce journaliste sur twitter</a>
              </span>
              </li>
              </ul>
      </div>
      <div class="bg_gris_moyen signature">
              <ul class="liste_bordure">
              <li class="clearfix" itemprop="author">
              <span class="identite">
              <a href="http://www.lemonde.fr/journaliste/maxime-vaudano/" target="_blank" class="gras">Maxime Vaudano</a>
              <br><span class="txt_gris_clair">Journaliste au Monde</span>

              </span>
              <span class="suivre">
              <strong class="txt1 txt_gris_moyen">Suivre</strong>
              <a href="http://www.lemonde.fr/journaliste/maxime-vaudano/" class="avatar13x13" target="_blank">Aller sur la page de ce journaliste</a>
              <a href="https://twitter.com/mvaudano" class="tw13x13" target="_blank">Suivre ce journaliste sur twitter</a>
              </span>
              </li>
              </ul>
      </div>



  <aside class="fenetre">

  <p class="tt20">Les données sur lesquelles nous avons travaillé</p>
    <p class="lire"><a href="https://docs.google.com/spreadsheets/d/1ItTGZfnAujE_O_bzekTCrPEcv4R6qQsYoEitP5HOzjg/edit?usp=sharing" target="_blank">Cliquez ici pour accéder aux données servant de base aux infographies</a></p>
    <p>Elles ont été compilées à partir du site <a href="http://www.votewatch.eu" target="_blank">Votewatch.eu</a>, qui répertorie les votes de chaque député européen pour chaque vote public.</p>
  </aside>


  </div>


</div>

</div>
	

  <script>
	

var margin = {top: 0, right: 0, bottom: 0, left: 0},
    width = 1000 - margin.left - margin.right,
    height = 480 - margin.top - margin.bottom;


bubulles(climat,"climat");
bubulles(union_bancaire,"union_bancaire");
bubulles(travailleurs_detaches,"travailleurs_detaches");
bubulles(protection_donnees,"protection_donnees");
bubulles(ttip,"ttip");

function bubulles(data,name) {
            var n = data.length, //NOMBRE
                padding = 40,
                radius = d3.scale.sqrt().range(data); 
            	 p = 0;

            var nodes = d3.range(n).map(function() {

            p++
           
            centre = eval("centre_"+data[p-1][1]);
            rayon = rayons[data[p-1][1]];
        
            
        
              return {
                radius: rayon,
                id: p-1,
                cx: centre[data[p-1][5]].split(",")[0],
                cy: centre[data[p-1][5]].split(",")[1],
                nom: data[p-1][2],
                vote: data[p-1][5],
                parti: data[p-1][4],
                groupe: data[p-1][3],
                type: data[p-1][1],
              	a : 1
              };
            });



            var force = d3.layout.force()
                .nodes(nodes)
                .size([width, height])
                .gravity(0)
                .charge(0)
                .on("tick", tick)
                .start();

            var vis = d3.select("#"+name).append("svg")
                .attr("width", width + margin.left + margin.right)
                .attr("height", height + margin.top + margin.bottom)
                .style("border", "1px solid #ccc")
            	  .append("g")
                .attr("transform", "translate(" + margin.left + "," + margin.top + ")");



             var rect = vis.selectAll("rect")
                .data(nodes)
              .enter().append("rect")
                .attr({
                  "width":function(d) {  return d.radius*2 },
                  "height":function(d) {  return d.radius*2 },
                  "rx":function(d) {  if(d.type == "fr") return d.radius*2 },
                  "ry":function(d) {  if(d.type == "fr") return d.radius*2 }
                })
                .attr("title", function(d) {  if(d.type == "fr") {
                  if(d.vote == "na") vote = "n'a pas voté";
                  else if(d.vote == "absent") vote = "était absent(e) pour le vote";
                  else if(d.vote == "abstention") vote = "s'est abstenu(e) sur le vote";
                  else vote = "a voté "+d.vote

                    html = "<p><span class=\"nom tt5_capital\">"+d.nom+"</span> <span class=\"vote\">"+vote+"</span></p><p>Membre</p><ul><li>du parti <span class=\"parti\" style=\"color:"+couleurs[d.parti]+"\">"+partis[d.parti]+" ("+d.parti+")</span> en France</li><li>du <span class=\"groupe\">"+partis[d.groupe]+"</span> au Parlement européen.</li></ul>"
                  }
                  else {
                    html = "Le <span class=\"parti\" style=\"color:"+couleurs[d.parti]+"\">"+partis[d.parti]+"</span> a voté <span class=\"vote\">"+d.vote+" à "+d.groupe+"&nbsp;%</span>.";
                  }
                  return html; })
                .attr("class", "bulle")
                .style("stroke","#FFF")
                .style("stroke-width","3")
                .style("fill", function(d) { 
                  return couleurs[d.parti];
                })
                .call(force.drag)
                .on('mouseover', function(d){ 
                      
                    // Colorer le contour de la bulle hoverée
                      d3.select(this)
                        .transition()
                        .duration(50)
                        .style("stroke","#ffc600");
                    
                   
                })
              .on('mouseout', function(d){ 
                    d3.select(this)
                        .transition()
                        .duration(0)
                        .style("stroke","#FFF");
                    $("g#poles ellipse").css({"stroke-width":"0","fill":""})
                    $("g#poles text").css({"fill":"#FFF"})
                      
                      
                      $("g#poles ellipse.horizontal").attr({"rx":"150","ry":"75"})
                      $("g#poles ellipse.vertical").attr({"rx":"75","ry":"150"})    
              });

            var text = vis.selectAll("text")
                .data(nodes)
              .enter().append("text")
                .text(function(d) { console.log(d); if(d.type == "eur") { return d.groupe+"%"; } })
                .attr("class", "pourcentage")
                .attr("title", function(d) {  
                    return "Au Parlement européen, le <span class=\"parti\" style=\"color:"+couleurs[d.parti]+"\">"+partis[d.parti]+"</span> a voté <span class=\"vote\">"+d.vote+" à "+d.groupe+"&nbsp;%</span>.";
                })
                .call(force.drag);


            vis.append("g")
              .attr({
                "class":"textes"
              });

            $.each(textes, function(i,value){

              d3.select("#"+name+" .textes")
              .append("text")
                .text(function(d){
                  return value[0]
                })
                .attr({
                "x":function(d){
                  return value[1]
                },
                "class":function(d){
                  return value[3]
                },
                "y":function(d){
                  return value[2]
                }
              })
            });



            $( "rect.bulle,text.pourcentage" ).tooltip({
              track: true,
              show: { effect: "fadeIn", duration: 100 },
              hide: { effect: "fadeOut", duration: 0 },
              content: function() {
                   var element = $( this );
                   return element.attr( "title" );
                 }
            });

            function tick(e) {
              rect
                  .each(gravity(.1 * e.alpha))
                  .each(collide(.2))
                  .attr("x", function(d) { return d.x; })
                  .attr("y", function(d) { return d.y; });
              text
                  .each(gravity(.1 * e.alpha))
                  .each(collide(.2))
                  .attr("x", function(d) { return d.x + d.radius; })
                  .attr("y", function(d) { return d.y + d.radius; });
            }

            // Move nodes toward cluster focus.
            function gravity(alpha) {
              return function(d) {
                d.y += (d.cy - d.y) * alpha;
                d.x += (d.cx - d.x) * alpha;
              };
            }

            // Resolve collisions between nodes.
            function collide(alpha) {
              var quadtree = d3.geom.quadtree(nodes);
              return function(d) {
                var r = d.radius + radius.domain()[1] + padding,
                    nx1 = d.x - r,
                    nx2 = d.x + r,
                    ny1 = d.y - r,
                    ny2 = d.y + r;
                quadtree.visit(function(quad, x1, y1, x2, y2) {
                  if (quad.point && (quad.point !== d)) {
                    var x = d.x - quad.point.x,
                        y = d.y - quad.point.y,
                        l = Math.sqrt(x * x + y * y),
                        r = d.radius + quad.point.radius + (d.color !== quad.point.color) * padding;
                    if (l < r) {
                      l = (l - r) / l * alpha;
                      d.x -= x *= l;
                      d.y -= y *= l;
                      quad.point.x += x;
                      quad.point.y += y;
                    }
                  }
                  return x1 > nx2
                      || x2 < nx1
                      || y1 > ny2
                      || y2 < ny1;
                });
              };
            }
}

</script>
</body>
</html>

